In [78]:
import pandas as pd
import numpy as np

In [79]:
url = 'https://raw.githubusercontent.com/Agablue-red/SalaryPrediction/main/dataset/Salary_Data.csv'
df = pd.read_csv(url)

In [80]:
df.head()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0

In [81]:
# remove special character
df.columns = df.columns.str.replace(' ', '')

In [82]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6704 entries, 0 to 6703
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Age                6702 non-null   float64
 1   Gender             6702 non-null   object
 2   EducationLevel     6701 non-null   object
 3   JobTitle           6702 non-null   object
 4   YearsofExperience  6701 non-null   float64
 5   Salary             6699 non-null   float64
dtypes: float64(3), object(3)
memory usage: 314.4+ KB

Unique values

In [83]:
df.nunique()

Age                   41
Gender                 3
EducationLevel         7
JobTitle             193
YearsofExperience     37
Salary               444
dtype: int64

In [84]:
print('Amount of unique values for', df['Gender'].unique())
print('Amount of unique values for', df['EducationLevel'].unique())

Amount of unique values for ['Male' 'Female' nan 'Other']
Amount of unique values for ["Bachelor's" "Master's" 'PhD' nan "Bachelor's Degree" "Master's Degree"
 'High School' 'phD']

In [85]:
df['EducationLevel'] = df['EducationLevel'].str.replace(" Degree", "")
df['EducationLevel'] = df['EducationLevel'].str.replace("phD", "PhD")

In [86]:
for column in df[['Gender','EducationLevel']]:
    if df[column].dtype == object:
        print(df[column].value_counts())

Male      3674
Female    3014
Other       14
Name: Gender, dtype: int64
Bachelor's     3023
Master's       1861
PhD            1369
High School     448
Name: EducationLevel, dtype: int64

Missing data

In [87]:
df.isna().sum()

Age                  2
Gender               2
EducationLevel       3
JobTitle             2
YearsofExperience    3
Salary               5
dtype: int64

In [88]:
# remove rows with only NaN value
df.dropna(how='all', inplace=True)
df.reset_index(drop=True, inplace=True)

In [89]:
for column in df.columns:
    df_nan = df[df[column].isnull()]
    
df_nan

,Age,Gender,EducationLevel,JobTitle,YearsofExperience,Salary
3134,31.0,Male,Master's,Full Stack Engineer,8.0,NaN
5245,26.0,Female,Bachelor's,Social M,NaN,NaN
6453,36.0,Male,Bachelor's,Sales Director,6.0,NaN

row 5245

In [90]:
for x in df['JobTitle'].unique():
    if x.startswith('Social'):
        print(x)

Social Media Specialist
Social Media Manager
Social M
Social Media Man

In [91]:
df['EducationLevel'] = df['EducationLevel'].str.replace("Social Media Man", "Social Media Manager")

In [92]:
row5247 = df.loc[(df['JobTitle'] == "Social Media Manager") &\
              (df['Age'] == 26.0) & (df['Gender'] == "Female") & (df['EducationLevel'] == "Bachelor's") |\
              (df['JobTitle'] == "Social M"), :] 
row5247

,Age,Gender,EducationLevel,JobTitle,YearsofExperience,Salary
5133,26.0,Female,Bachelor's,Social Media Manager,3.0,55000.0
5161,26.0,Female,Bachelor's,Social Media Manager,3.0,55000.0
5189,26.0,Female,Bachelor's,Social Media Manager,3.0,55000.0
5217,26.0,Female,Bachelor's,Social Media Manager,3.0,55000.0
5245,26.0,Female,Bachelor's,Social M,NaN,NaN
5382,26.0,Female,Bachelor's,Social Media Manager,3.0,55000.0
5410,26.0,Female,Bachelor's,Social Media Manager,3.0,55000.0
5438,26.0,Female,Bachelor's,Social Media Manager,3.0,55000.0
5466,26.0,Female,Bachelor's,Social Media Manager,3.0,55000.0

In [93]:
df['JobTitle'] = df['JobTitle'].str.replace("Social M", "Social Media Manager")

In [94]:
# at- access a single value for a row/column label
df.at[5245,'Salary'] = np.round(row5247['Salary'].mean(),0)
df.at[5245,'YearsofExperience'] = np.round(row5247['YearsofExperience'].mean(),0)

In [95]:
df.loc[df.index[5245], :]

Age                                  26.0
Gender                             Female
EducationLevel                 Bachelor's
JobTitle             Social Media Manager
YearsofExperience                     3.0
Salary                            55000.0
Name: 5245, dtype: object

row 3134

In [96]:
df.loc[df.index[3134], :]

Age                                 31.0
Gender                              Male
EducationLevel                  Master's
JobTitle             Full Stack Engineer
YearsofExperience                    8.0
Salary                               NaN
Name: 3134, dtype: object

In [97]:
row3134 = df.loc[(df['EducationLevel'] == "Master's") & (df['JobTitle'] == "Full Stack Engineer") & (df['YearsofExperience'] == 8.0), :] 
row3134

,Age,Gender,EducationLevel,JobTitle,YearsofExperience,Salary
1227,36.0,Female,Master's,Full Stack Engineer,8.0,140000.0
1324,36.0,Female,Master's,Full Stack Engineer,8.0,140000.0
1407,36.0,Male,Master's,Full Stack Engineer,8.0,140000.0
2133,35.0,Female,Master's,Full Stack Engineer,8.0,140000.0
2573,33.0,Female,Master's,Full Stack Engineer,8.0,122581.0
2632,32.0,Female,Master's,Full Stack Engineer,8.0,123781.0
2819,33.0,Female,Master's,Full Stack Engineer,8.0,122970.0
2938,33.0,Female,Master's,Full Stack Engineer,8.0,122970.0
3057,33.0,Female,Master's,Full Stack Engineer,8.0,122970.0
3095,31.0,Male,Master's,Full Stack Engineer,8.0,120288.0
3134,31.0,Male,Master's,Full Stack Engineer,8.0,NaN

In [98]:
# at- access a single value for a row/column label
df.at[3134,'Salary'] = np.round(row3134['Salary'].mean(),0)

In [99]:
df.loc[df.index[3134], :]

Age                                 31.0
Gender                              Male
EducationLevel                  Master's
JobTitle             Full Stack Engineer
YearsofExperience                    8.0
Salary                          129556.0
Name: 3134, dtype: object

row 6453

In [100]:
df.loc[df.index[6453], :]

Age                            36.0
Gender                         Male
EducationLevel           Bachelor's
JobTitle             Sales Director
YearsofExperience               6.0
Salary                          NaN
Name: 6453, dtype: object

In [101]:
row6453 = df.loc[(df['EducationLevel'] == "Bachelor's") & (df['JobTitle'] == "Sales Director") & (df['YearsofExperience'] == 6.0), :] 
row6453

       Age  Gender EducationLevel        JobTitle  YearsofExperience   Salary
6304  29.0    Male     Bachelor's  Sales Director                6.0  75000.0
6358  29.0  Female     Bachelor's  Sales Director                6.0  75000.0
6383  36.0    Male     Bachelor's  Sales Director                6.0  75000.0
6397  36.0    Male     Bachelor's  Sales Director                6.0  75000.0
6411  36.0    Male     Bachelor's  Sales Director                6.0  75000.0
6425  36.0    Male     Bachelor's  Sales Director                6.0  75000.0
6439  36.0    Male     Bachelor's  Sales Director                6.0  75000.0
6453  36.0    Male     Bachelor's  Sales Director                6.0      NaN
6502  36.0    Male     Bachelor's  Sales Director                6.0  75000.0
6516  36.0    Male     Bachelor's  Sales Director                6.0  75000.0
6530  36.0    Male     Bachelor's  Sales Director                6.0  75000.0
6544  36.0    Male     Bachelor's  Sales Director                6.0  75000.0
6558  36.0    Male     Bachelor's  Sales Director                6.0  75000.0
6572  36.0    Male     Bachelor's  Sales Director                6.0  75000.0

In [102]:
df.at[6453,'Salary'] = np.round(row6453['Salary'].mean(),0)

In [103]:
df.loc[df.index[6453], :]

Age                            36.0
Gender                         Male
EducationLevel           Bachelor's
JobTitle             Sales Director
YearsofExperience               6.0
Salary                      75000.0
Name: 6453, dtype: object

Duplicate

In [104]:
print('Orginal dataset consists of', df.shape[0], 'rows.\nDataset without duplicated values consists of', 
      df.shape[0] - df.duplicated().sum(), 'rows.\nI will dropp', np.round(df.duplicated().sum() / df.shape[0] * 100,2), '% rows.')

Orginal dataset consists of 6702 rows.
Dataset without duplicated values consists of 1789 rows.
I will dropp 73.31 % rows.

In [105]:
df.drop_duplicates(keep = 'first', inplace=True)
df.reset_index(drop=True, inplace = True)

Dtype

In [107]:
for column in df.columns:
    if df[column].dtype == float:
        df[column] = pd.to_numeric(df[column], downcast='integer')

In [108]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1789 entries, 0 to 1788
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Age                1789 non-null   int8
 1   Gender             1789 non-null   object
 2   EducationLevel     1788 non-null   object
 3   JobTitle           1789 non-null   object
 4   YearsofExperience  1789 non-null   float64
 5   Salary             1789 non-null   int32
dtypes: float64(1), int32(1), int8(1), object(3)
memory usage: 64.8+ KB

In [109]:
df

,Age,Gender,EducationLevel,JobTitle,YearsofExperience,Salary
0,32,Male,Bachelor's,Software Engineer,5.0,90000
1,28,Female,Master's,Data Analyst,3.0,65000
2,45,Male,PhD,Senior Manager,15.0,150000
3,36,Female,Bachelor's,Sales Associate,7.0,60000
4,52,Male,Master's,Director,20.0,200000
...,...,...,...,...,...,...
1784,43,Female,Master's,Digital Marketing Manager,15.0,150000
1785,27,Male,High School,Sales Manager,2.0,40000
1786,33,Female,Bachelor's,Director of Marketing,8.0,80000
1787,37,Male,Bachelor's,Sales Director,7.0,90000
1788,30,Female,Bachelor's,Sales Manager,5.0,70000

In [110]:
df.to_csv(r'C:\Users\agnie\OneDrive\Dokumenty\Github\SalaryPrediction\dataset\clean_data.csv', index=False, header=True)